notes/resources/materialize/materialize.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-13 Thu 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MaterializeCSS</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">MaterializeCSS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8b7427b">1. PDFs</a></li>
<li><a href="#orgbe52d48">2. Colours</a>
<ul>
<li><a href="#org662e09c">2.1. Background colour</a></li>
<li><a href="#orgc7ab1f7">2.2. Text colour</a></li>
<li><a href="#orgf8f1569">2.3. Colours</a></li>
<li><a href="#orgf06ad50">2.4. Accents</a></li>
</ul>
</li>
<li><a href="#org6c1b2d9">3. Grid</a>
<ul>
<li><a href="#org35fe292">3.1. Container</a></li>
<li><a href="#org701072a">3.2. Row</a></li>
<li><a href="#org5c3787c">3.3. Columns</a></li>
<li><a href="#org198342c">3.4. Offset</a></li>
<li><a href="#org8fabd41">3.5. Push and pull</a></li>
<li><a href="#org1e3996e">3.6. Section and divider</a></li>
<li><a href="#orgb4a086c">3.7. Sizes</a></li>
</ul>
</li>
<li><a href="#org3819334">4. Helpers</a>
<ul>
<li><a href="#orgda1d4c9">4.1. Vertical align</a></li>
<li><a href="#org7898a01">4.2. Text align</a></li>
<li><a href="#org045e9af">4.3. Floats</a></li>
<li><a href="#orgff71259">4.4. Hiding and showing content</a></li>
<li><a href="#org4c1d850">4.5. Truncate</a></li>
<li><a href="#org890034e">4.6. Hover</a></li>
<li><a href="#org021f091">4.7. Browser Defaults</a></li>
</ul>
</li>
<li><a href="#org04c7f5c">5. Media</a>
<ul>
<li><a href="#orgde08496">5.1. Images</a></li>
<li><a href="#orgb434128">5.2. Videos</a></li>
</ul>
</li>
<li><a href="#org34b3faa">6. Pulse</a></li>
<li><a href="#org9e9075a">7. Shadow</a></li>
<li><a href="#orga7fdc5e">8. Waves</a></li>
<li><a href="#orgc6af790">9. Transitions</a></li>
<li><a href="#org7026f99">10. Typography</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8b7427b" class="outline-2">
<h2 id="org8b7427b"><span class="section-number-2">1</span> PDFs</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="elements.pdf">Elements</a></li>
<li><a href="icons.pdf">Icons</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbe52d48" class="outline-2">
<h2 id="orgbe52d48"><span class="section-number-2">2</span> Colours</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org662e09c" class="outline-3">
<h3 id="org662e09c"><span class="section-number-3">2.1</span> Background colour</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>teal</b> and a light/dark accent eg. <b>lighten-2</b> to an element
</p>
</div>
</div>

<div id="outline-container-orgc7ab1f7" class="outline-3">
<h3 id="orgc7ab1f7"><span class="section-number-3">2.2</span> Text colour</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>teal-text</b> and a light/dark accent eg. <b>text-darken-2</b> to an element
</p>
</div>
</div>

<div id="outline-container-orgf8f1569" class="outline-3">
<h3 id="orgf8f1569"><span class="section-number-3">2.3</span> Colours</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<b>red</b>, <b>pink</b>, <b>purple</b>, <b>deep-purple</b>, <b>indigo</b>, <b>blue</b>, <b>light-blue</b>, <b>cyan</b>, <b>teal</b>, <b>green</b>, <b>light-green</b>, <b>lime</b>, <b>yellow</b>, <b>amber</b>, <b>orange</b>, <b>deep-orange</b>, <b>brown</b>, <b>grey</b>, <b>blue-gray</b>, and <b>black/white/transparent</b>
</p>
</div>
</div>

<div id="outline-container-orgf06ad50" class="outline-3">
<h3 id="orgf06ad50"><span class="section-number-3">2.4</span> Accents</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<b>lighten-1</b> to 4, <b>darken-1</b> to 4, <b>accent-1</b> to 4
</p>
</div>
</div>
</div>

<div id="outline-container-org6c1b2d9" class="outline-2">
<h2 id="org6c1b2d9"><span class="section-number-2">3</span> Grid</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org35fe292" class="outline-3">
<h3 id="org35fe292"><span class="section-number-3">3.1</span> Container</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>container</b> class to a div to increase the element's padding
</p>
</div>
</div>

<div id="outline-container-org701072a" class="outline-3">
<h3 id="org701072a"><span class="section-number-3">3.2</span> Row</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>row</b> class to create a row
</p>
</div>
</div>

<div id="outline-container-org5c3787c" class="outline-3">
<h3 id="org5c3787c"><span class="section-number-3">3.3</span> Columns</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>col s6</b> class to a div to make it small and 6 column width span
</p>
</div>
</div>

<div id="outline-container-org198342c" class="outline-3">
<h3 id="org198342c"><span class="section-number-3">3.4</span> Offset</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<b>col s6 offset-s6</b> to offset on small devices by 6 columns
</p>
</div>
</div>

<div id="outline-container-org8fabd41" class="outline-3">
<h3 id="org8fabd41"><span class="section-number-3">3.5</span> Push and pull</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<b>push-s5</b> or <b>pull-s7</b> to push or pull by the desired column amount
</p>
</div>
</div>

<div id="outline-container-org1e3996e" class="outline-3">
<h3 id="org1e3996e"><span class="section-number-3">3.6</span> Section and divider</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<b>section</b> class to create extra padding, add a <b>divider</b> class to create 1px gray divider
</p>
</div>
</div>

<div id="outline-container-orgb4a086c" class="outline-3">
<h3 id="orgb4a086c"><span class="section-number-3">3.7</span> Sizes</h3>
<div class="outline-text-3" id="text-3-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&lt; 600</td>
<td class="org-left">&gt; 600</td>
<td class="org-left">&gt; 992</td>
<td class="org-left">&gt; 1200</td>
</tr>

<tr>
<td class="org-left"><b>s</b></td>
<td class="org-left"><b>m</b></td>
<td class="org-left"><b>l</b></td>
<td class="org-left"><b>xl</b></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org3819334" class="outline-2">
<h2 id="org3819334"><span class="section-number-2">4</span> Helpers</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgda1d4c9" class="outline-3">
<h3 id="orgda1d4c9"><span class="section-number-3">4.1</span> Vertical align</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<b>valign-wrapper</b> on a div to align content vertically
</p>
</div>
</div>

<div id="outline-container-org7898a01" class="outline-3">
<h3 id="org7898a01"><span class="section-number-3">4.2</span> Text align</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<b>left-align</b> <b>right-align</b> <b>center-align</b>
</p>
</div>
</div>

<div id="outline-container-org045e9af" class="outline-3">
<h3 id="org045e9af"><span class="section-number-3">4.3</span> Floats</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<b>left</b> and <b>right</b>
</p>
</div>
</div>

<div id="outline-container-orgff71259" class="outline-3">
<h3 id="orgff71259"><span class="section-number-3">4.4</span> Hiding and showing content</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li><b>hide</b> - Hidden for all Devices</li>
<li><b>hide-on-small-only</b> - Hidden for Mobile Only</li>
<li><b>hide-on-med-only</b> - Hidden for Tablet Only</li>
<li><b>hide-on-med-and-down</b> - Hidden for Tablet and Below</li>
<li><b>hide-on-med-and-up</b> - Hidden for Tablet and Above</li>
<li><b>hide-on-large-only</b> - Hidden for Desktop Only</li>
<li><b>show-on-small</b> - Show for Mobile Only</li>
<li><b>show-on-medium</b> - Show for Tablet Only</li>
<li><b>show-on-large</b> - Show for Desktop Only</li>
<li><b>show-on-medium-and-up</b> - Show for Tablet and Above</li>
<li><b>show-on-medium-and-down</b> - Show for Tablet and Below</li>
</ul>
</div>
</div>

<div id="outline-container-org4c1d850" class="outline-3">
<h3 id="org4c1d850"><span class="section-number-3">4.5</span> Truncate</h3>
<div class="outline-text-3" id="text-4-5">
<p>
<b>truncate</b> show only a bit of the text
</p>
</div>
</div>

<div id="outline-container-org890034e" class="outline-3">
<h3 id="org890034e"><span class="section-number-3">4.6</span> Hover</h3>
<div class="outline-text-3" id="text-4-6">
<p>
<b>hoverable</b> to create a shadow effect on hover
</p>
</div>
</div>

<div id="outline-container-org021f091" class="outline-3">
<h3 id="org021f091"><span class="section-number-3">4.7</span> Browser Defaults</h3>
<div class="outline-text-3" id="text-4-7">
<p>
<b>browser-defaults</b> for default effects on <b>ul</b> <b>select</b> <b>input</b>
</p>
</div>
</div>
</div>

<div id="outline-container-org04c7f5c" class="outline-2">
<h2 id="org04c7f5c"><span class="section-number-2">5</span> Media</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgde08496" class="outline-3">
<h3 id="orgde08496"><span class="section-number-3">5.1</span> Images</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<b>responsive-img</b>, <b>circle</b> to add responsiveness and/or a circle effect
</p>
</div>
</div>

<div id="outline-container-orgb434128" class="outline-3">
<h3 id="orgb434128"><span class="section-number-3">5.2</span> Videos</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<b>video-container</b> to make a video embed responsive, <b>responsive-video</b> for a HTML5 vid responsiveness
</p>
</div>
</div>
</div>

<div id="outline-container-org34b3faa" class="outline-2">
<h2 id="org34b3faa"><span class="section-number-2">6</span> Pulse</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>pulse</b> to make buttons pulse periodically
</p>
</div>
</div>

<div id="outline-container-org9e9075a" class="outline-2">
<h2 id="org9e9075a"><span class="section-number-2">7</span> Shadow</h2>
<div class="outline-text-2" id="text-7">
<p>
<b>z-depth-0</b> to <b>z-depth-5</b> for varying shadow depth effects, 0 - no shadow
</p>
</div>
</div>

<div id="outline-container-orga7fdc5e" class="outline-2">
<h2 id="orga7fdc5e"><span class="section-number-2">8</span> Waves</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><b>waves-effect</b> for a wave effect</li>
<li><b>waves-light</b> for a white wave</li>
<li><b>waves-red</b> or any other colour for a coloured waves</li>
</ul>
</div>
</div>

<div id="outline-container-orgc6af790" class="outline-2">
<h2 id="orgc6af790"><span class="section-number-2">9</span> Transitions</h2>
<div class="outline-text-2" id="text-9">
<p>
Make sure to add the base transition class <b>scale-transition</b>. Then add the class <b>scale-out</b> to scale the element down until it is hidden. To start something as hidden, add the class <b>scale-out</b> first, and then add the class  <b>scale-in</b> to scale the element up until it is shown.
</p>
</div>
</div>

<div id="outline-container-org7026f99" class="outline-2">
<h2 id="org7026f99"><span class="section-number-2">10</span> Typography</h2>
<div class="outline-text-2" id="text-10">
<p>
Headings 1 to 6, <b>blockquote</b> tag and <b>flow-text</b> class for responsive text that scales size with the screen size
</p>

<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-08-15 Tue 15:16</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2018-12-13 Thu 20:45</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
